SunCity/src/Catalogs/БонусныеПрограммыЛояльности/БонусныеПрограммыЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БонусныеПрограммыЛояльности</name>
  <attributes>
    <name>КурсКонвертацииБонусовВВалюту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйПроцентОплатыБонусами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаКонвертацииБонусов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретНачисленияБалловПриОплатеБонусами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатуры</name>
    <type>
      <types>DefinedType.СегментНоменклатурыСерверЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>DefinedType.ВидОплатыСерверЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>УменьшатьСуммуЧекаДляСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>МаксимальныйПроцентОплатыБонусами</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/Catalogs/БонусныеПрограммыЛояльности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает реквизиты объекта, которые необходимо блокировать от изменения.
//
// Возвращаемое значение:
//  Массив - блокируемые реквизиты объекта.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("КурсКонвертацииБонусовВВалюту");
	Результат.Добавить("МаксимальныйПроцентОплатыБонусами");
	Результат.Добавить("ВалютаКонвертацииБонусов");
	Результат.Добавить("ЗапретНачисленияБалловПриОплатеБонусами");
	Результат.Добавить("СегментНоменклатуры");
	Результат.Добавить("ЦеновыеГруппы");
	Результат.Добавить("ВидОплаты");
	Результат.Добавить("УменьшатьСуммуЧекаДляСкидок");
	
	Возврат Результат;

КонецФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
